Revit 2024 API
RebarFreeFormAccessor.RebarStyle Property
 Identifies the RebarStyle of the current Rebar element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public RebarStyle RebarStyle { get; set; }
Visual Basic
Public Property RebarStyle As RebarStyle
	Get
	Set
Visual C++
public:
property RebarStyle RebarStyle {
	RebarStyle get ();
	void set (RebarStyle value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace